# Set2DCompByStyle

```pascal
FUNCTION Set2DCompByStyle(
				hObject : HANDLE;
				byStyle : BOOLEAN): BOOLEAN;
```

```python
def vs.Set2DCompByStyle(hObject, byStyle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|byStyle|BOOLEAN|   |

## Version
Availability: from Vectorworks 2020

## Category
* Objects - Custom